#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.azapi_resource.databricks_private_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_private_subnet" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.1.0.64/26"
              [32m+[0m[0m delegations                       = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                      [32m+[0m[0m properties = {
                          [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                        }
                    },
                ]
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "DatabricksPrivateSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azapi_resource.databricks_public_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "databricks_public_subnet" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.1.0.128/26"
              [32m+[0m[0m delegations                       = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name       = "DatabricksSubnetDelegation"
                      [32m+[0m[0m properties = {
                          [32m+[0m[0m serviceName = "Microsoft.Databricks/workspaces"
                        }
                    },
                ]
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "DatabricksPublicSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azapi_resource.private_endpoint_subnet[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "private_endpoint_subnet" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m addressPrefix                     = "10.1.0.0/27"
              [32m+[0m[0m delegations                       = []
              [32m+[0m[0m ipAllocations                     = []
              [32m+[0m[0m networkSecurityGroup              = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001"
                }
              [32m+[0m[0m privateEndpointNetworkPolicies    = "Enabled"
              [32m+[0m[0m privateLinkServiceNetworkPolicies = "Enabled"
              [32m+[0m[0m routeTable                        = {
                  [32m+[0m[0m id = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001"
                }
              [32m+[0m[0m serviceEndpointPolicies           = []
              [32m+[0m[0m serviceEndpoints                  = []
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m name                      = "ServicesSubnet"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m type                      = "Microsoft.Network/virtualNetworks/subnets@2022-07-01"
    }

[1m  # module.data_management_zone.azurerm_resource_group.automation_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "automation_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-automation-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.consumption_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "consumption_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-consumption-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.container_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "container_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-container-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "governance_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-governance-rg"
    }

[1m  # module.data_management_zone.azurerm_resource_group.unity_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_resource_group" "unity_rg" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "northeurope"
      [32m+[0m[0m name     = "mydmgmt-dev-unity-rg"
    }

[1m  # module.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_container_registry.container_registry[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m anonymous_pull_enabled        = false
      [32m+[0m[0m data_endpoint_enabled         = false
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "mydmgmtdevacr001"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = [
          [32m+[0m[0m {
              [32m+[0m[0m default_action = "Deny"
            },
        ]
      [32m+[0m[0m public_network_access_enabled = false
      [32m+[0m[0m quarantine_policy_enabled     = false
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m retention_policy_in_days      = 7
      [32m+[0m[0m sku                           = "Premium"
      [32m+[0m[0m trust_policy_enabled          = false
      [32m+[0m[0m zone_redundancy_enabled       = false

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_container_registry" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevacr001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevacr001-registry-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-container-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevacr001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevacr001-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "registry",
            ]
        }
    }

[1m  # module.data_management_zone.module.container_registry.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-dbac001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-unity-rg"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_databricks_workspace.databricks_workspace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [32m+[0m[0m access_connector_id                   = (known after apply)
      [32m+[0m[0m customer_managed_key_enabled          = false
      [32m+[0m[0m default_storage_firewall_enabled      = true
      [32m+[0m[0m disk_encryption_set_id                = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled     = true
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m managed_disk_identity                 = (known after apply)
      [32m+[0m[0m managed_resource_group_id             = (known after apply)
      [32m+[0m[0m managed_resource_group_name           = "mydmgmt-dev-cnsmptn-dbw001-rg"
      [32m+[0m[0m name                                  = "mydmgmt-dev-cnsmptn-dbw001"
      [32m+[0m[0m network_security_group_rules_required = "NoAzureDatabricksRules"
      [32m+[0m[0m public_network_access_enabled         = false
      [32m+[0m[0m resource_group_name                   = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m sku                                   = "premium"
      [32m+[0m[0m storage_account_identity              = (known after apply)
      [32m+[0m[0m workspace_id                          = (known after apply)
      [32m+[0m[0m workspace_url                         = (known after apply)

      [32m+[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [32m+[0m[0m no_public_ip                                         = true
          [32m+[0m[0m private_subnet_name                                  = "DatabricksPrivateSubnet"
          [32m+[0m[0m private_subnet_network_security_group_association_id = (known after apply)
          [32m+[0m[0m public_ip_name                                       = (known after apply)
          [32m+[0m[0m public_subnet_name                                   = "DatabricksPublicSubnet"
          [32m+[0m[0m public_subnet_network_security_group_association_id  = (known after apply)
          [32m+[0m[0m storage_account_name                                 = (known after apply)
          [32m+[0m[0m storage_account_sku_name                             = "Standard_LRS"
          [32m+[0m[0m virtual_network_id                                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001"
          [32m+[0m[0m vnet_address_prefix                                  = (known after apply)
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-cnsmptn-dbw001-auth-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-cnsmptn-dbw001-auth-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-cnsmptn-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-cnsmptn-dbw001-auth-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "browser_authentication",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-cnsmptn-dbw001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-cnsmptn-dbw001-uiapi-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "databricks_ui_api",
            ]
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mydmgmt-dev-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.data_management_zone.module.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.data_management_zone.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "612081e2-c034-4d91-91f8-50c4390fbf50"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.key_vault.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_synapse_private_link_hub_web" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmtdevsynplh001-web-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmtdevsynplh001-web-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-consumption-rg"
      [32m+[0m[0m subnet_id                     = (known after apply)

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmtdevsynplh001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmtdevsynplh001-web-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "web",
            ]
        }
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_private_link_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmtdevsynplh001"
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-consumption-rg"
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity[0m will be created
[0m  [32m+[0m[0m resource "azurerm_user_assigned_identity" "user_assigned_identity" {
      [32m+[0m[0m client_id           = (known after apply)
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m location            = "northeurope"
      [32m+[0m[0m name                = "mydmgmt-dev-uai001"
      [32m+[0m[0m principal_id        = (known after apply)
      [32m+[0m[0m resource_group_name = "mydmgmt-dev-automation-rg"
      [32m+[0m[0m tenant_id           = (known after apply)
    }

[1mPlan:[0m 27 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>